Tekla.Structures.Dialog.UIControls.EnvironmentFiles.GetMultiDirectoryFileList(System.Collections.Generic.List{System.String},System.String)
Gets a list of files with the given extension from the given search directories.
searchDirectories: The search directories to be used.
fileExtension: The file extension to be used.
Returns: A list of found file names without the file extension.